# Information Systems for Engineers Fall 2023 - Cheat Sheet

During the exam, you will be required to write SQL queries using a Jupyter notebook.

This notebook is designed to help you start writing your queries by providing you an environment with the datasets loaded and a simple query that you can use to recap the syntax of SQL.

Feel free to extend this notebook and use it for preparing the answers you need for the exam. Take into account that the content of this notebook will not be considered for grading.

## SQL

There is a local PostgreSQL 16.1 installation with a dataset loaded into a database. Run the next cell to connect to it.

In [1]:
%load_ext sql
%sql  postgresql://postgres:example@db

To print the tables currently loaded in the database run:

In [2]:
%%sql

SELECT * 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_TYPE = 'BASE TABLE' and TABLE_CATALOG = 'postgres' and TABLE_SCHEMA = 'public'
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('postgres', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'nwemployees', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'employeeterritories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'order_details', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

To print the attributes of a particular table (`players`, for example) run:

In [3]:
%%sql

SELECT column_name, data_type, character_maximum_length
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name = 'players';

 * postgresql://postgres:***@db
10 rows affected.

[('player_id', 'integer', None),
 ('dob', 'date', None),
 ('player_id', 'smallint', None),
 ('dob', 'date', None),
 ('country_id', 'character', 3),
 ('country_id', 'character', 3),
 ('first_name', 'character varying', 16),
 ('first_name', 'character varying', 64),
 ('last_name', 'character varying', 64),
 ('last_name', 'character varying', 32)]

## Complex query example

More complex PostgreSQL queries would look like:

In [4]:
%%sql
SELECT players.country_id, COUNT(players.player_id)
    FROM players INNER JOIN ranking ON players.player_id = ranking.player_id
    WHERE ranking.rank < 10
GROUP BY players.country_id
ORDER BY players.country_id
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[('ARG', 541), ('AUS', 265), ('AUT', 76), ('BEL', 11)]

## Exam database − data from the rankings of the Association of Tennis Professionals (ATP)

The dataset consists of relations containing real world information such as players, their statistics, rankings and tournaments. A shortened version of the dataset was used in the quiz throughout the course.

Here is some basic information on the database tables.

### 1) `players` table - shows the players born after 1980 and that have ever reached the top 500 in the rankings

| attribute name | description| 
|:---|:---|
|   `player_id`|   uniquely identifies a player|
|   `first_name`|   player's first name|
|   `last_name`|   player's last name|
|   `dob`|   player's date of birth|
|   `country_id`|   country code of player's nationality|

In [5]:
%%sql
SELECT * FROM players LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(4369, 'Yu', 'Wang', datetime.date(1984, 5, 19), 'CHN'),
 (32860, 'Omar', 'El Gazzar', datetime.date(1992, 8, 13), 'EGY'),
 (27789, 'Vincent', 'Schutte', datetime.date(1993, 11, 10), 'NED'),
 (36490, 'Leroy', 'Miller', datetime.date(1993, 8, 17), 'AUS')]

### 2) `ranking` table - shows the top 10 rankings over time

| attribute name | description| 
|:---|:---|
|   `player_id`|   uniquely identifies a player|
|   `rank`|   player's ranking|
|   `rank_date`|   date of the reported ranking|
|   `rank_points`|   player's ranking points|

In [6]:
%%sql
SELECT * FROM ranking LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(datetime.date(1998, 6, 8), 3498, 68, 661),
 (datetime.date(1998, 6, 15), 3498, 68, 661),
 (datetime.date(1998, 6, 22), 3498, 72, 661),
 (datetime.date(1998, 7, 6), 3498, 73, 661)]

### 3) `tournaments` table - shows the tournaments

| attribute name | description| 
|:---|:---|
|   `tournament_id`|   uniquely identifies a tournament|
|   `name`|   name of the tournament|
|   `surface`|   type of surface at a tournament|

In [7]:
%%sql
SELECT * 
FROM tournaments
ORDER BY tournament_id
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(1, 'Australian Chps.', 'G'),
 (2, 'Los Angeles', 'H'),
 (3, 'Cincinnati Masters', 'H'),
 (4, 'Barcelona', 'C')]

### 4) `matches` table - shows matches after and including 2015 of the players that ever occurred in the top 10 list

| attribute name  | description| 
|:----------------|:---|
| `match_id`      |   uniquely identifies a record of a match|
| `player_id`     |   uniquely identifies a player|
| `tournament_id` |   uniquely identifies a tournament|
| `season`        |   year the match was played|
| `p_matches`     |   outcome of the match: *1* if player won, *0* if player lost|
| `p_bp_fc`       |   number of break points the player faced|
| `p_bp_sv`       |   number of break points the player saved|
| `round`         |   round of the match during a tournament|
| `opponent_rank` |   rank of opponent|
| `minutes`       |   duration of the match in minutes|

In [8]:
%%sql
SELECT * FROM matches LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(108213, 3598, 291, 'R64', 1999, 47, 1, 4, 6, 86),
 (108210, 3720, 291, 'R64', 1999, 50, 1, 8, 13, 109),
 (108329, 3498, 287, 'R32', 1999, 11, 1, 2, 2, 84),
 (108938, 3720, 290, 'SF', 1999, 66, 1, 2, 3, 69)]

### 5) `stats` table - shows statistics of the players who are in the top players table

| attribute name | description| 
|:---|:---|
|   `player_id`|   uniquely identifies a player|
|   `p_matches`|   number of matches the player won (e.g., 3)|
|   `o_matches`|   number of matches the opponent won (e.g., 5)|
|   `p_sets`|   number of sets the player won (e.g. 2)|
|   `o_sets`|   number of sets the opponent won (e.g. 1)|

In [9]:
%%sql
SELECT * FROM stats LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(3565, 37, 72, 107, 179),
 (44778, 0, 1, 0, 3),
 (3762, 0, 1, 1, 2),
 (4000, 2, 9, 12, 26)]

**PLEASE NOTE: TRY TO LIMIT YOUR OUTPUT. SOME OF THE TABLES ARE LARGE AND PRINTING ALL OF THEM MIGHT SLOW DOWN YOUR WORK ENVIRONMENT.**

##### Note: the examples provided above do not contain all the query operations you might need during the exam.

Now its your turn, you can write all your queries in new cells below. Feel free to add as many cells as needed.

---

# Round 1

In [10]:
%%sql 
SELECT first_name
FROM matches m
JOIN players p 
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [11]:
%%sql 
SELECT *
FROM players p
JOIN ranking r
ON p.player_id = r.player_id
WHERE date_part('month', rank_date) = 8 
      AND date_part('day', rank_date) = 8 
      AND last_name = 'Federer'
LIMIT 5;

 * postgresql://postgres:***@db
3 rows affected.

[(3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2005, 8, 8), 3819, 1, 6500),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2011, 8, 8), 3819, 3, 9710),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2016, 8, 8), 3819, 3, 5945)]

In [12]:
%%sql 
SELECT SUM(minutes)
FROM
    (SELECT DISTINCT match_id, minutes
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [13]:
%%sql
SELECT p.country_id, ROUND(AVG(p_matches),2) AS avg_win_rate
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE p.country_id IN 
                (SELECT country_id
                FROM players p
                GROUP BY country_id
                HAVING COUNT(*) > 3)
GROUP BY p.country_id
ORDER BY avg_win_rate DESC
LIMIT 1 OFFSET 0

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [14]:
%%sql
SELECT t.name, ABS(MIN(p.dob) - MAX(p.dob)) AS gap
FROM matches m
JOIN players p
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
GROUP BY t.name
ORDER BY gap DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [15]:
%%sql
SELECT *
FROM matches
LIMIT 5

 * postgresql://postgres:***@db
5 rows affected.

[(108213, 3598, 291, 'R64', 1999, 47, 1, 4, 6, 86),
 (108210, 3720, 291, 'R64', 1999, 50, 1, 8, 13, 109),
 (108329, 3498, 287, 'R32', 1999, 11, 1, 2, 2, 84),
 (108938, 3720, 290, 'SF', 1999, 66, 1, 2, 3, 69),
 (108936, 3720, 290, 'QF', 1999, 36, 1, 0, 0, 35)]

In [16]:
%%sql
SELECT player_id, SUM(p_matches) AS tot_won
FROM matches
WHERE season >= 2015
GROUP BY player_id
ORDER BY tot_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [17]:
%%sql
SELECT m.player_id, p.last_name, COUNT(DISTINCT tournament_id) AS num_part
FROM matches m
JOIN players p
ON p.player_id = m.player_id
WHERE season >= 2016
GROUP BY m.player_id, p.last_name
ORDER BY num_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(5303, 'Sousa', 43)]

In [18]:
%%sql
SELECT t.name, COUNT(DISTINCT m.match_id) AS num_matches
FROM matches m
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY num_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [19]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [20]:
%%sql
SELECT * 
FROM matches
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[(108213, 3598, 291, 'R64', 1999, 47, 1, 4, 6, 86),
 (108210, 3720, 291, 'R64', 1999, 50, 1, 8, 13, 109),
 (108329, 3498, 287, 'R32', 1999, 11, 1, 2, 2, 84),
 (108938, 3720, 290, 'SF', 1999, 66, 1, 2, 3, 69),
 (108936, 3720, 290, 'QF', 1999, 36, 1, 0, 0, 35)]

In [21]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS uniq_players
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY uniq_players DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

----

## Round 2

In [22]:
%%sql 
SELECT first_name
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
JOIN players p
ON p.player_id = m.player_id
WHERE t.name = 'London'
ORDER BY p.dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [23]:
%%sql 
SELECT *
FROM players p
JOIN ranking r
ON p.player_id = r.player_id
WHERE p.last_name = 'Federer' AND 
        date_part('month', r.rank_date) = 8 AND
        date_part('day', r.rank_date) = 8

 * postgresql://postgres:***@db
3 rows affected.

[(3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2005, 8, 8), 3819, 1, 6500),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2011, 8, 8), 3819, 3, 9710),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2016, 8, 8), 3819, 3, 5945)]

In [24]:
%%sql 
SELECT SUM(minutes)
FROM
    (SELECT DISTINCT m.match_id, m.minutes
    FROM matches m
    JOIN players p
    ON p.player_id = m.player_id
    WHERE p.dob  >= '1989-01-01'
    ORDER BY m.minutes DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [25]:
%%sql
SELECT *
FROM matches m
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[(108213, 3598, 291, 'R64', 1999, 47, 1, 4, 6, 86),
 (108210, 3720, 291, 'R64', 1999, 50, 1, 8, 13, 109),
 (108329, 3498, 287, 'R32', 1999, 11, 1, 2, 2, 84),
 (108938, 3720, 290, 'SF', 1999, 66, 1, 2, 3, 69),
 (108936, 3720, 290, 'QF', 1999, 36, 1, 0, 0, 35),
 (115077, 3507, 11, 'R64', 2001, 30, 1, 5, 6, 105),
 (115083, 3819, 11, 'R64', 2001, 24, 1, 4, 6, 144),
 (110412, 3602, 251, 'R32', 2000, 139, 1, 4, 6, 86),
 (110916, 3819, 1, 'R128', 2000, 38, 1, 1, 3, 125),
 (111911, 3498, 4, 'R16', 2000, 40, 1, 3, 6, 111)]

In [26]:
%%sql 
SELECT country_id, ROUND(AVG(p_matches),2) AS win_rate
FROM matches m
JOIN players p
ON p.player_id = m.player_id
GROUP BY p.country_id
HAVING COUNT(*) >= 3
ORDER BY AVG(p_matches) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [27]:
%%sql 
SELECT t.tournament_id, t.name, ABS(MIN(p.dob) - MAX(p.dob)) as age_gap
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
JOIN players p
ON p.player_id = m.player_id
GROUP BY t.tournament_id
ORDER BY ABS(MIN(p.dob) - MAX(p.dob)) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(39, 'Davis Cup G1', 7768)]

In [28]:
%%sql 
SELECT p.player_id, SUM(m.p_matches) as total_won
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE season >= 2015
GROUP BY p.player_id
ORDER BY SUM(m.p_matches) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [29]:
%%sql 
SELECT p.player_id, first_name, last_name, COUNT(DISTINCT tournament_id) AS part_tourn
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE m.season >= 2016
GROUP BY p.player_id
ORDER BY COUNT(DISTINCT tournament_id) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(5303, 'Joao', 'Sousa', 43)]

In [30]:
%%sql
SELECT t.tournament_id, t.name, COUNT(DISTINCT match_id) AS tot_matches
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
WHERE m.season >= 2015
GROUP BY t.tournament_id
ORDER BY COUNT(DISTINCT match_id) DESC
LIMIT 1

 * postgresql://postgres:***@db
1 rows affected.

[(1, 'Australian Chps.', 381)]

In [31]:
%%sql 
SELECT country_id, AVG(AGE(dob))
FROM players 
GROUP BY country_id
ORDER BY AVG(AGE(dob)) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [32]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS tot_players
FROM matches
WHERE season >= 2015
GROUP BY season 
ORDER BY COUNT(DISTINCT player_id) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 3

In [33]:
%%sql
SELECT first_name
FROM matches m
JOIN players p
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [34]:
%%sql
SELECT DISTINCT rank
FROM players p
JOIN ranking r
ON r.player_id = p.player_id
WHERE last_name = 'Federer' AND 
        EXTRACT(month FROM rank_date) = 8 AND
        EXTRACT(day FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
2 rows affected.

[(1,), (3,)]

In [35]:
%%sql
SELECT SUM(match_dur)
FROM 
    (SELECT match_id, SUM(DISTINCT minutes) AS match_dur
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE dob >= '1989-01-01'
    GROUP BY m.match_id
    ORDER BY match_dur DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(Decimal('3673'),)]

In [36]:
%%sql
SELECT p.country_id, ROUND(AVG(p_matches),2) AS winning_rate
FROM players p
JOIN matches m
ON p.player_id = m.player_id
GROUP BY p.country_id
HAVING COUNT(*) > 3
ORDER BY winning_rate DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [37]:
%%sql
SELECT t.name, ABS(MAX(dob) - MIN(dob)) AS age_gap
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
JOIN players p
ON p.player_id = m.player_id
GROUP BY t.name
ORDER BY age_gap DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [38]:
%%sql
SELECT player_id, SUM(p_matches) AS num_matches
FROM matches
WHERE season >= 2015
GROUP BY player_id
ORDER BY num_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [39]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT tournament_id) AS part_tourn
FROM matches m
JOIN players p
ON m.player_id = p.player_id
WHERE m.season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY part_tourn DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [40]:
%%sql
SELECT t.name, COUNT(DISTINCT m.match_id) AS num_matches
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
WHERE season >= 2015
GROUP BY t.tournament_id
ORDER BY num_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [41]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [42]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS num_part_players
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY num_part_players DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 4

In [43]:
%%sql
SELECT first_name
FROM players p
JOIN matches m
ON m.player_id = p.player_id
JOIN tournaments t
ON m.tournament_id = t.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [44]:
%%sql

LIMIT 10;

 * postgresql://postgres:***@db
(psycopg2.errors.SyntaxError) syntax error at or near "LIMIT"
LINE 1: LIMIT 10;
        ^

[SQL: LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [45]:
%%sql
SELECT *
FROM players p
JOIN ranking r
ON r.player_id = p.player_id
WHERE p.first_name = 'Roger' AND p.last_name = 'Federer' AND EXTRACT(month FROM rank_date) = 8 AND EXTRACT(day FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
3 rows affected.

[(3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2005, 8, 8), 3819, 1, 6500),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2011, 8, 8), 3819, 3, 9710),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2016, 8, 8), 3819, 3, 5945)]

In [46]:
%%sql
SELECT SUM(minutes)
FROM 
    (SELECT DISTINCT match_id, minutes
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10)

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [47]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2) AS win_rate
FROM players p
JOIN matches m
ON p.player_id = m.player_id
GROUP BY country_id
HAVING COUNT(DISTINCT p.player_id) >= 3
ORDER BY win_rate DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [48]:
%%sql
SELECT t.name, MAX(dob) - MIN(dob) AS age_gap
FROM matches m
JOIN players p
ON p.player_id = m.player_id
JOIN tournaments t
ON m.tournament_id = t.tournament_id
GROUP BY t.name
ORDER BY age_gap DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [49]:
%%sql
SELECT player_id, SUM(p_matches) AS tot_won
FROM matches
WHERE season >= 2015
GROUP BY player_id
ORDER BY tot_won DESC
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[(4913, 137),
 (4742, 135),
 (4920, 135),
 (6219, 123),
 (5442, 120),
 (5131, 118),
 (5663, 112),
 (4606, 108),
 (5763, 103),
 (4526, 101)]

In [50]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT tournament_id) AS part
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [51]:
%%sql
SELECT t.name, COUNT(DISTINCT m.match_id) AS num_match
FROM tournaments t
JOIN matches m
ON t.tournament_id = m.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY num_match DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [52]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [53]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS tot_part
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY tot_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 5

In [54]:
%%sql
SELECT first_name
FROM players p
JOIN matches m
ON p.player_id = m.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY p.dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [55]:
%%sql
SELECT *
FROM players p
JOIN ranking r
ON p.player_id = r.player_id
WHERE first_name = 'Roger' AND last_name = 'Federer' AND EXTRACT(month FROM rank_date) = 8 AND EXTRACT(day FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
3 rows affected.

[(3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2005, 8, 8), 3819, 1, 6500),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2011, 8, 8), 3819, 3, 9710),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2016, 8, 8), 3819, 3, 5945)]

In [56]:
%%sql
SELECT SUM(minutes)
FROM 
    (SELECT DISTINCT m.match_id, minutes
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE p.dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [57]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2) AS win_rate
FROM players p
JOIN matches m
ON p.player_id = m.player_id
GROUP BY p.country_id
HAVING COUNT(DISTINCT m.player_id) > 3
ORDER BY win_rate DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [58]:
%%sql
SELECT t.name, ABS(MIN(dob) - MAX(dob)) AS age_gap
FROM tournaments t
JOIN matches m
ON t.tournament_id = m.tournament_id
JOIN players p
ON m.player_id = p.player_id
GROUP BY t.name
ORDER BY age_gap DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [59]:
%%sql
SELECT player_id, SUM(p_matches) AS tot_won
FROM matches
WHERE season >= 2015
GROUP by player_id
ORDER BY tot_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [60]:
%%sql
SELECT p.player_id, p.first_name, p.last_name, COUNT(DISTINCT m.tournament_id) AS part_tour
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE season >= 2016
GROUP BY p.player_id, p.first_name, p.last_name
ORDER BY part_tour DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(5303, 'Joao', 'Sousa', 43)]

In [61]:
%%sql
SELECT t.name, COUNT(DISTINCT m.match_id) AS tot_matches
FROM tournaments t
JOIN matches m
ON t.tournament_id = m.tournament_id
WHERE m.season >= 2015
GROUP BY t.name
ORDER BY tot_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [62]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [63]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS tot_part
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY tot_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 6

In [64]:
%%sql
SELECT first_name
FROM players p
JOIN matches m
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [65]:
%%sql
SELECT DISTINCT rank
FROM players p
JOIN ranking r
ON r.player_id = p.player_id
WHERE first_name = 'Roger' AND last_name = 'Federer' AND EXTRACT(day FROM rank_date) = 8 AND EXTRACT(month FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
2 rows affected.

[(1,), (3,)]

In [66]:
%%sql
SELECT SUM(minutes)
FROM
    (SELECT DISTINCT match_id, minutes
    FROM players p
    JOIN matches m
    ON p.player_id = m.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10)

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [67]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2) AS avg_win
FROM players p
JOIN matches m
ON p.player_id = m.player_id
GROUP BY country_id
HAVING COUNT(DISTINCT p.player_id) > 3
ORDER BY avg_win DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [68]:
%%sql
SELECT t.name, ABS(MAX(dob) - MIN(dob)) AS age_gap
FROM matches m
JOIN tournaments t
ON t.tournament_id = m.tournament_id
JOIN players p
ON m.player_id = p.player_id
GROUP BY t.name
ORDER BY age_gap DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [69]:
%%sql
SELECT player_id, COUNT(DISTINCT match_id) AS tot_won
FROM matches
WHERE season >= 2015 AND p_matches = 1
GROUP BY player_id
ORDER BY tot_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [70]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT tournament_id) AS tour_part
FROM matches m
JOIN players p
ON p.player_id = m.player_id
WHERE season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY tour_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [71]:
%%sql
SELECT t.name, COUNT(DISTINCT match_id) AS num_matches
FROM tournaments t
JOIN matches m
ON t.tournament_id = m.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY num_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [72]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [73]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS num_players
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY num_players DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 7

In [74]:
%%sql
SELECT first_name
FROM players p
JOIN matches m
ON p.player_id = m.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIt 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [75]:
%%sql
SELECT DISTINCT rank
FROM players p
JOIN ranking r
ON p.player_id = r.player_id
WHERE first_name = 'Roger' AND last_name = 'Federer' AND EXTRACT(DAY FROM rank_date) = 8 AND EXTRACT(MONTH FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
2 rows affected.

[(1,), (3,)]

In [76]:
%%sql
SELECT SUM(minutes)
FROM 
    (SELECT DISTINCT match_id, minutes
    FROM matches m
    JOIN players p
    ON p.player_id = m.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10)

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [77]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2) AS avg_out
FROM players p
JOIN matches m
ON m.player_id = p.player_id
GROUP BY country_id
HAVING COUNT(DISTINCT p.player_id) > 3
ORDER BY avg_out DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [78]:
%%sql
SELECT t.name, ABS(MAX(dob) - MIN(dob)) AS avg_diff
FROM matches m
JOIN tournaments t 
ON m.tournament_id = t.tournament_id
JOIN players p
ON p.player_id = m.player_id
GROUP BY t.name
ORDER BY avg_diff DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [79]:
%%sql
SELECT player_id, SUM(p_matches) AS match_won
FROM matches
WHERE season >= 2015
GROUP BY player_id
ORDER BY match_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [80]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT t.tournament_id) AS part_tour
FROM players p
JOIN matches m
ON p.player_id = m.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY part_tour DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [81]:
%%sql
SELECT t.name, COUNT(DISTINCT match_id) AS tot_matches
FROM matches m
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY tot_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [82]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [83]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS distinct_players
FROM matches
WHERE season >= 2015
GROUP BY season
ORDER BY distinct_players DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 8

In [84]:
%%sql
SELECT first_name
FROM matches m
JOIN players p
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [85]:
%%sql
SELECT *
FROM players p
JOIN ranking r
ON r.player_id = p.player_id
WHERE first_name = 'Roger' AND last_name = 'Federer' AND EXTRACT(day FROM rank_date) = 8 AND EXTRACT(month FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
3 rows affected.

[(3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2005, 8, 8), 3819, 1, 6500),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2011, 8, 8), 3819, 3, 9710),
 (3819, 'Roger', 'Federer', datetime.date(1981, 8, 8), 'SUI', datetime.date(2016, 8, 8), 3819, 3, 5945)]

In [86]:
%%sql
SELECT SUM(minutes)
FROM 
    (SELECT DISTINCT match_id, minutes
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [87]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2) AS avg_outcome
FROM matches m
JOIN players p
ON m.player_id = p.player_id
GROUP BY country_id
HAVING COUNT(DISTINCT p.player_id) > 3
ORDER BY avg_outcome DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [88]:
%%sql 
SELECT t.name, ABS(MAX(dob) - MIN(dob)) AS age_diff
FROM matches m
JOIN players p
ON p.player_id = m.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
GROUP BY t.name
ORDER BY age_diff DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [89]:
%%sql
SELECT player_id, COUNT(DISTINCT match_id) AS matches_won
FROM matches
WHERE season >= 2015 AND p_matches = 1
GROUP BY player_id
ORDER BY matches_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [90]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT tournament_id) AS part_tourn
FROM players p
JOIN matches m
ON p.player_id = m.player_id
WHERE season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY part_tourn DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [91]:
%%sql
SELECT t.name, COUNT(DISTINCT match_id) AS num_matches
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY num_matches DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.', 381)]

In [92]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [93]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS tot_players
FROM matches m
WHERE season >= 2015
GROUP BY season
ORDER BY tot_players DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---

# Round 9

In [102]:
%%sql
SELECT first_name
FROM matches m
JOIN players p
ON m.player_id = p.player_id
JOIN tournaments t
ON t.tournament_id = m.tournament_id
WHERE t.name = 'London'
ORDER BY dob DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Gael',)]

In [105]:
%%sql
SELECT DISTINCT rank
FROM players p
JOIN ranking r
ON p.player_id = r.player_id
WHERE first_name = 'Roger' AND last_name = 'Federer' AND EXTRACT(MONTH FROM rank_date) = 8 AND EXTRACT(DAY FROM rank_date) = 8
LIMIT 10;

 * postgresql://postgres:***@db
2 rows affected.

[(1,), (3,)]

In [113]:
%%sql
SELECT SUM(minutes)
FROM 
    (SELECT DISTINCT match_id, minutes
    FROM matches m
    JOIN players p
    ON m.player_id = p.player_id
    WHERE dob >= '1989-01-01'
    ORDER BY minutes DESC
    LIMIT 10);

 * postgresql://postgres:***@db
1 rows affected.

[(3673,)]

In [119]:
%%sql
SELECT country_id, ROUND(AVG(p_matches),2)
FROM matches m
JOIN players p
ON m.player_id = p.player_id
GROUP BY country_id
ORDER BY AVG(p_matches) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('SUI', Decimal('0.71'))]

In [124]:
%%sql
SELECT t.name, ABS(MAX(p.dob) - MIN(p.dob)) AS age_diff
FROM matches m 
JOIN tournaments t
ON m.tournament_id = t.tournament_id
JOIN players p
ON p.player_id = m.player_id
GROUP BY t.name
ORDER BY age_diff DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Davis Cup G1', 7768)]

In [130]:
%%sql
SELECT player_id, SUM(p_matches) AS tot_won
FROM matches
WHERE season >= 2015
GROUP BY player_id
ORDER BY tot_won DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(4913, 137)]

In [138]:
%%sql
SELECT p.first_name, p.last_name, COUNT(DISTINCT m.tournament_id) AS tot_part
FROM matches m
JOIN players p
ON m.player_id = p.player_id
WHERE season >= 2016
GROUP BY p.first_name, p.last_name
ORDER BY tot_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Joao', 'Sousa', 43)]

In [145]:
%%sql
SELECT t.name
FROM matches m
JOIN tournaments t
ON m.tournament_id = t.tournament_id
WHERE season >= 2015
GROUP BY t.name
ORDER BY SUM(DISTINCT match_id) DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('Australian Chps.',)]

In [149]:
%%sql
SELECT country_id, AVG(AGE(dob)) AS avg_age
FROM players
GROUP BY country_id
ORDER BY avg_age DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('PNG', datetime.timedelta(days=16396))]

In [157]:
%%sql
SELECT season, COUNT(DISTINCT player_id) AS tot_part
FROM matches m
WHERE season >= 2015
GROUP BY season
ORDER BY tot_part DESC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(2016, 404)]

---